# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [21]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [22]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
Unnamed: 0    1016395 non-null int64
Id            1016395 non-null int64
Name          1016395 non-null object
Year          1016395 non-null int64
Gender        1016395 non-null object
State         1016395 non-null object
Count         1016395 non-null int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [23]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [24]:
baby_names_sliced = baby_names.loc[:,'Name':'Count']
baby_names_sliced.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Are there more male or female names in the dataset?

In [25]:
male_female = baby_names_sliced.groupby('Gender').Gender.count()
male_female

Gender
F    558846
M    457549
Name: Gender, dtype: int64

In [26]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [27]:
names = baby_names_sliced.groupby('Name').sum().reset_index()
names.sort_values('Name', ascending=False)
names.head()

      Name    Year  Count
0    Aaban    4027     12
1    Aadan    8039     23
2  Aadarsh    2009      5
3    Aaden  393963   3426
4   Aadhav    2014      6

### Step 8. How many different names exist in the dataset?

In [32]:
print('There are',names['Name'].nunique(), 'different names in the dataset' )

There are 17632 different names in the dataset

In [33]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [34]:
print('The name with most occurences is:', baby_names_sliced.groupby('Name')['Count'].sum().idxmax())

The name with most occurences is: Jacob

### Step 10. How many different names have the least occurrences?

In [35]:
least_common_name = names[names['Count'] == (names['Count'].min())]
len(least_common_name)

2578

### Step 11. What is the median name occurrence?

In [36]:
print('The median name occurence is: ', names['Count'].median())

The median name occurence is:  49.0

### Step 12. What is the standard deviation of names?

In [12]:
names['Count'].std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [13]:
summary= pd.DataFrame(names['Count'].describe())
summary

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000